Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionTextAttributes.TextPlacing Property
 The place of the dimension value text.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.DimensionTextPlacings TextPlacing { get; set; }
Public Property TextPlacing As DimensionSetBaseAttributes.DimensionTextPlacings
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.DimensionTextPlacings
See Also
Reference
DimensionSetBaseAttributes.DimensionTextAttributes Class
Tekla.Structures.Drawing Namespace